[
	{
		"title": "Coverage Requirements Discovery (CRD)",
		"icon": "squares-plus",
		"description": "Automatically queries payers to discover what documentation is required for prior authorization before submitting requests.",
		"category": "Authorization"
	},
	{
		"title": "Document Template & Rules (DTR)",
		"icon": "eye",
		"description": "Auto-gathers required clinical notes, treatment plans, and lab reports from EMR/OIS to fulfill payer documentation requirements.",
		"category": "Authorization"
	},
	{
		"title": "Prior Authorization Support (PAS)", 
		"icon": "light-bulb",
		"description": "Submits complete authorization packets to payers via FHIR APIs and tracks approval status in real-time.",
		"category": "Authorization"
	},
	{
		"title": "Real-Time Authorization Status",
		"icon": "user",
		"description": "Monitor authorization progress with live updates: Submitted, More Info Needed, Approved, or Denied with denial reasons.",
		"category": "Authorization"
	},
	{
		"title": "mCODE Patient Profiles",
		"icon": "circle-stack",
		"description": "Unifies EMR, OIS, imaging, and lab data into standardized mCODE oncology profiles for each patient automatically.",
		"category": "Pathways"
	},
	{
		"title": "Clinical Pathway Builder",
		"icon": "arrow-path-rounded-square",
		"description": "Create and customize institutional treatment protocols by disease site, staging, and technique with dose constraints and guidelines.",
		"category": "Pathways"
	},
	{
		"title": "Protocol Conformance Check",
		"icon": "mobile",
		"description": "Instantly verify that proposed treatment plans align with your institution's approved clinical protocols and guidelines.",
		"category": "Pathways"
	},
	{
		"title": "Role-Based Task Assignment",
		"icon": "user-group",
		"description": "Automatically assigns next steps to physicians, physicists, dosimetrists, and billing staff based on treatment plan approval workflow.",
		"category": "Pathways"
	},
	{
		"title": "EMR FHIR Integration",
		"icon": "arrow-path-rounded-square",
		"description": "Securely connects to Electronic Medical Records via FHIR APIs to extract patient demographics, diagnoses, and clinical notes.",
		"category": "Pathways"
	},
	{
		"title": "OIS Treatment Plan Sync",
		"icon": "computer-desktop",
		"description": "Integrates with Oncology Information Systems to pull radiation therapy plans, dose calculations, and treatment parameters.",
		"category": "Pathways"
	},
	{
		"title": "Local LLM Processing",
		"icon": "squares-plus",
		"description": "Processes unstructured clinical notes using a private, secure AI model that runs entirely within your hospital network.",
		"category": "Security"
	},
	{
		"title": "PHI Network Isolation",
		"icon": "shield-check",
		"description": "All patient health information stays within your hospital infrastructure—no data ever transmitted to external AI services.",
		"category": "Security"
	},
	{
		"title": "Role-Based Access Control",
		"icon": "key",
		"description": "Granular permissions ensure clinicians, billing staff, and administrators only access patient data relevant to their role.",
		"category": "Security"
	},
	{
		"title": "FHIR API Security",
		"icon": "eye-slash",
		"description": "End-to-end encryption for all API communications with EMR, OIS, and payer systems following healthcare security standards.",
		"category": "Security"
	},
	{
		"title": "Audit Trail Logging",
		"icon": "document-text",
		"description": "Complete audit logs track every user action, data access, and system change for compliance and security monitoring.",
		"category": "Security"
	},
	{
		"title": "Authorization Dashboard",
		"icon": "rectangle-stack",
		"description": "Centralized view of all prior authorization requests with filtering by status, patient, provider, and approval timeline.",
		"category": "Authorization"
	},
	{
		"title": "Denial Management",
		"icon": "document-text",
		"description": "Track denial reasons, missing documentation, and resubmission requirements to reduce authorization delays and improve approval rates.",
		"category": "Authorization"
	},
	{
		"title": "Clinical Decision Support",
		"icon": "light-bulb",
		"description": "Provides evidence-based treatment recommendations and guideline concordance alerts during pathway selection and planning.",
		"category": "Pathways"
	}
]
